app/controllers/spots_controller.rb

SELECT * FROM "spots"
INSERT INTO "spots" ("created_at", "updated_at", "occupied") VALUES('2011-05-05 04:05:22', '2011-05-05 04:05:22', 'f')
SELECT * FROM "spots" WHERE ("spots"."id" = 1)
---
  def index
    @spots = Spot.all

    if @spots.empty?
     for i in 1..12 do
      spot = Spot.new
      spot.occupied = false
      spot.save
     end
    end
     @spot_1 = Spot.find(1)

SELECT * FROM "spots" WHERE ("spots"."id" = 1)
UPDATE "spots" SET "updated_at" = '2011-05-05 04:35:24', "occupied" = 't' WHERE "id" = 1
---
  def occupyspot
    @spot = Spot.find(params[:id])
    @spot.occupied = true
    @spot.save

SELECT * FROM "spots" WHERE ("spots"."id" = 1)
UPDATE "spots" SET "updated_at" = '2011-05-05 04:39:26', "occupied" = 'f' WHERE "id" = 1
---
  def unoccupyspot
    @spot = Spot.find(params[:id])
    @spot.occupied = false
    @spot.save